export const questions = [
  {
    title: "Что такое операционная система?",
    answers: [
      {
        title:
          "Это просто программа на компьютере, как и другие - Word или Chrome",
        correct: false,
      },
      {
        title:
          "Это показатель того, какой процессор используется на компьютере. Например, 32-битный или 64-битный",
        correct: false,
      },
      {
        title:
          "Это набор взаимосвязанных программ, осуществляющих управление компьютером и взаимодействие с пользователем",
        correct: true,
      },
      {
        title: 'Нет такого понятия, есть понятие "файловая система"',
        correct: false,
      },
    ],
  },
  {
    title: "Является ли Android операционной системой?",
    answers: [
      {
        title:
          "Да, это такая же ОС, как и другие, просто для мобильных девайсов",
        correct: true,
      },
      {
        title: "Нет, операционные системы бывают только для ПК",
        correct: false,
      },
      {
        title:
          "Нет, Android это программа, которая ставится на операционную систему девайса. ОС на разных девайсах разные",
        correct: false,
      },
      {
        title: "Это домашняя страничка в настройках вашего браузера",
        correct: false,
      },
    ],
  },
  {
    title: "Что такое процессор компьютера?",
    answers: [
      {
        title:
          "Это блок, внутри которого находится дисковод и много разъемов для монитора, клавиатуры и компьютерной мышки",
        correct: false,
      },
      {
        title: "Это общее название всех комплектующих компьютера",
        correct: false,
      },
      {
        title:
          "Это элемент компьютера, с помощью которого обрабатывается информация, находящаяся как в собственной памяти, так и в памяти других устройств ",
        correct: true,
      },
      {
        title:
          "Это суммарный показатель вычислительной мощности компьютера, например 2,7 ГГц",
        correct: false,
      },
    ],
  },
  {
    title: "Какие бывают разрядности у современных процессоров?",
    answers: [
      {
        title: "32 и 64 бита",
        correct: true,
      },
      {
        title: "12 и 32 бита",
        correct: false,
      },
      {
        title: "15 и 32 бита",
        correct: false,
      },
      {
        title: "86 и 64 бита",
        correct: false,
      },
    ],
  },
  {
    title: "Какой тип процессора чаще всего используют мобильные девайсы?",
    answers: [
      {
        title: "iOS использует Intel, остальные используют AMD",
        correct: false,
      },
      {
        title: "Чаще всего используют Intel",
        correct: false,
      },
      {
        title: "Чаще всего используют AMD",
        correct: false,
      },
      {
        title: "Чаще всего используют ARM",
        correct: true,
      },
    ],
  },
  {
    title: "Для чего компьютеру нужна RAM?",
    answers: [
      {
        title: "Для быстрого доступа к данным",
        correct: true,
      },
      {
        title: "Для долгосрочного хранения данных",
        correct: false,
      },
      {
        title: "Для правильной фрагментации памяти",
        correct: false,
      },
      {
        title: "Для дефрагментации данных",
        correct: false,
      },
    ],
  },
  {
    title: "Чем отличается HDD от SSD?",
    answers: [
      {
        title:
          "HDD - это твердотельный накопитель без подвижных частей. Более дешевый, чем SSD. HDD работает быстрее",
        correct: false,
      },
      {
        title:
          "SSD - это твердотельный накопитель без подвижных частей. Более дешевый, чем HDD. SSD работает быстрее",
        correct: false,
      },
      {
        title:
          "SSD - это твердотельный накопитель без подвижных частей. Более дорогой, чем HDD. SSD работает быстрее",
        correct: true,
      },
    ],
  },
  {
    title: "Как отличаются между собой USB?",
    answers: [
      {
        title: "Бывают только USB 2.0 и 3.2",
        correct: false,
      },
      {
        title: "Бывают только micro-USB и mini-USB",
        correct: false,
      },
      {
        title:
          "USB отличаются по пропускной способности (micro-USB, mini-USB, lightning и т.д.) и форме (USB 2.0, USB 3.2)",
        correct: false,
      },
      {
        title:
          "USB отличаются по форме (micro-USB, mini-USB, lightning и т.д.) и пропускной способности (USB 2.0, USB 3.2)",
        correct: true,
      },
    ],
  },
  {
    title: "Какой файловой системы не существует?",
    answers: [
      {
        title: "Fat",
        correct: false,
      },
      {
        title: "NTFS",
        correct: false,
      },
      {
        title: "APFS",
        correct: false,
      },
      {
        title: "BolSFS",
        correct: true,
      },
    ],
  },
];
